#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ratata.github_branch.branches["dev"] will be created
  + resource "github_branch" "branches" {
      + branch        = "dev"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "test-repo"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.ratata.github_branch.branches["main"] will be created
  + resource "github_branch" "branches" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "test-repo"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.ratata.github_branch.branches["stage"] will be created
  + resource "github_branch" "branches" {
      + branch        = "stage"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "test-repo"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.ratata.github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "This is a test repository"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "test-repo"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # module.ratata.module.issue_templates.github_repository_file.bug_template will be created
  + resource "github_repository_file" "bug_template" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "dev"
      + commit_author                = "DevOps Team"
      + commit_email                 = "devops@yourcompany.com"
      + commit_message               = "Add bug report issue template"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            ---
            name: Bug Report
            about: Create a report to help us improve
            title: '[BUG] '
            labels: bug
            assignees: ''
            ---
            
            ## Describe the bug
            A clear and concise description of what the bug is.
            
            ## To Reproduce
            Steps to reproduce the behavior:
            1. Go to '...'
            2. Click on '....'
            3. Scroll down to '....'
            4. See error
            
            ## Expected behavior
            A clear and concise description of what you expected to happen.
            
            ## Screenshots
            If applicable, add screenshots to help explain your problem.
            
            ## Environment
             - OS: [e.g. iOS]
             - Browser/Version: [e.g. chrome, safari]
             - Application Version: [e.g. 22]
            
            ## Additional context
            Add any other context about the problem here.
        EOT
      + file                         = ".github/ISSUE_TEMPLATE/bug_report.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "test-repo"
      + sha                          = (known after apply)
    }

  # module.ratata.module.issue_templates.github_repository_file.feature_template will be created
  + resource "github_repository_file" "feature_template" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "dev"
      + commit_author                = "DevOps Team"
      + commit_email                 = "devops@yourcompany.com"
      + commit_message               = "Add feature request issue template"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            ---
            name: Feature Request
            about: Suggest an idea for this project
            title: '[FEATURE] '
            labels: enhancement
            assignees: ''
            ---
            
            ## Is your feature request related to a problem? Please describe.
            A clear and concise description of what the problem is. Ex. I'm always frustrated when [...]
            
            ## Describe the solution you'd like
            A clear and concise description of what you want to happen.
            
            ## Describe alternatives you've considered
            A clear and concise description of any alternative solutions or features you've considered.
            
            ## Additional context
            Add any other context or screenshots about the feature request here.
        EOT
      + file                         = ".github/ISSUE_TEMPLATE/feature_request.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "test-repo"
      + sha                          = (known after apply)
    }

  # module.ratata.module.issue_templates.github_repository_file.task_template will be created
  + resource "github_repository_file" "task_template" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "dev"
      + commit_author                = "DevOps Team"
      + commit_email                 = "devops@yourcompany.com"
      + commit_message               = "Add task issue template"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            ---
            name: Task
            about: Create a task that needs to be completed
            title: '[TASK] '
            labels: task
            assignees: ''
            ---
            
            ## Task Description
            A clear and concise description of what needs to be done.
            
            ## Acceptance Criteria
            - [ ] Criterion 1
            - [ ] Criterion 2
            - [ ] Criterion 3
            
            ## Dependencies
            List any dependencies or blockers for this task.
            
            ## Additional Information
            Any other information that would be helpful for completing this task.
        EOT
      + file                         = ".github/ISSUE_TEMPLATE/task.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "test-repo"
      + sha                          = (known after apply)
    }

  # module.ratata.module.issue_templates.github_repository_file.template_directory will be created
  + resource "github_repository_file" "template_directory" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "dev"
      + commit_author                = "DevOps Team"
      + commit_email                 = "devops@yourcompany.com"
      + commit_message               = "Initialize issue template directory"
      + commit_sha                   = (known after apply)
      + file                         = ".github/ISSUE_TEMPLATE/.gitkeep"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "test-repo"
      + sha                          = (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @ZDSDD, Action: `pull_request`, Workflow: `Terraform CI/CD`*